; domain
(define (domain boxman)

    (:requirements :strips :typing :equality :universal-preconditions :conditional-effects)
    (:types box loc)

    (:predicates
        (clear ?l - loc) ; nothing in location
        (boxat ?b - box ?l - loc) ; box in location
        (roleat ?l - loc) ; role in location
        (access ?l1 - loc ?l2 - loc) ; loc1 to loc2 accessible
        (rowcol ?l1 - loc ?l2 - loc) ; loc1 and loc2 in the same row or col
    )

    (:action move ; blank to blank
        :parameters (?l1 - loc ?l2 - loc)
        :precondition (and (roleat ?l1) (access ?l1 ?l2) (clear ?l2))
        :effect (and (not (roleat ?l1)) (not (clear ?l2)) (clear ?l1) (roleat ?l2))
    )
    
    (:action push ; push box to blank
        :parameters (?b - box ?l1 - loc ?l2 - loc ?l3 - loc)
        :precondition (and (roleat ?l1) (boxat ?b ?l2) (clear ?l3) (access ?l1 ?l2) (access ?l2 ?l3) (rowcol ?l1 ?l3))
        :effect (and (not (roleat ?l1)) (not (boxat ?b ?l2)) (not (clear ?l3)) (roleat ?l2) (boxat ?b ?l3) (clear ?l1))
    )
    

)

; problem
(define (problem boxman5) (:domain boxman)

(:objects
    b1 b2 b3 - box
    l16 l15 l14 l21 l22 l23 l24 l25 l26 l31 l33 l34 l41 l42 l43 l44 l53 l54 l63 l64 - loc
)

(:init
    (clear l16) (clear l15) (clear l14) (clear l21) (clear l22)
    (clear l24) (clear l25) (clear l26) (clear l31) (clear l33)
    (clear l43) (clear l44) (clear l53) (clear l54) (clear l63)
    (clear l64) 

    (roleat l41) 
    (boxat b1 l23) (boxat b2 l34) (boxat b3 l42)
    
    (access l16 l26) (access l16 l15) (access l15 l16)
    (access l15 l25) (access l15 l14) (access l14 l15)
    (access l14 l24) (access l26 l16) (access l26 l25)
    (access l25 l26) (access l25 l15) (access l25 l24)
    (access l24 l25) (access l24 l23) (access l24 l14)
    (access l24 l34) (access l23 l24) (access l23 l22)
    (access l23 l33) (access l22 l21) (access l22 l23)
    (access l21 l22) (access l21 l31) (access l34 l24)
    (access l34 l44) (access l34 l33) (access l33 l23)
    (access l33 l34) (access l33 l43) (access l31 l21)
    (access l31 l41) (access l44 l34) (access l44 l54)
    (access l44 l43) (access l43 l44) (access l43 l42)
    (access l43 l33) (access l43 l53) (access l42 l41)
    (access l42 l43) (access l41 l31) (access l41 l42)
    (access l54 l44) (access l54 l64) (access l54 l53)
    (access l53 l43) (access l53 l63) (access l53 l54)
    (access l64 l54) (access l64 l63) (access l63 l53)
    (access l63 l64)

    (rowcol l16 l15) (rowcol l16 l14) (rowcol l16 l26)
    (rowcol l15 l16) (rowcol l15 l14) (rowcol l15 l25)
    (rowcol l14 l16) (rowcol l14 l15) (rowcol l14 l24)
    (rowcol l14 l34) (rowcol l14 l44) (rowcol l14 l54)
    (rowcol l14 l64) (rowcol l21 l22) (rowcol l21 l23)
    (rowcol l21 l24) (rowcol l21 l25) (rowcol l21 l26)
    (rowcol l21 l31) (rowcol l21 l41) (rowcol l22 l21)
    (rowcol l22 l23) (rowcol l22 l24) (rowcol l22 l25)
    (rowcol l22 l26) (rowcol l22 l42) (rowcol l23 l21)
    (rowcol l23 l22) (rowcol l23 l24) (rowcol l23 l25)
    (rowcol l23 l26) (rowcol l23 l33) (rowcol l23 l43)
    (rowcol l23 l53) (rowcol l23 l63) (rowcol l24 l14)
    (rowcol l24 l21) (rowcol l24 l22) (rowcol l24 l23)
    (rowcol l24 l25) (rowcol l24 l26) (rowcol l24 l34)
    (rowcol l24 l44) (rowcol l24 l54) (rowcol l24 l64)
    (rowcol l25 l15) (rowcol l25 l21) (rowcol l25 l22)
    (rowcol l25 l23) (rowcol l25 l24) (rowcol l25 l26)
    (rowcol l26 l16) (rowcol l26 l21) (rowcol l26 l22)
    (rowcol l26 l23) (rowcol l26 l24) (rowcol l26 l25)
    (rowcol l31 l21) (rowcol l31 l33) (rowcol l31 l34)
    (rowcol l31 l41) (rowcol l33 l23) (rowcol l33 l31)
    (rowcol l33 l34) (rowcol l33 l43) (rowcol l33 l53)
    (rowcol l33 l63) (rowcol l34 l14) (rowcol l34 l24)
    (rowcol l34 l31) (rowcol l34 l33) (rowcol l34 l44)
    (rowcol l34 l54) (rowcol l34 l64) (rowcol l41 l21)
    (rowcol l41 l31) (rowcol l41 l42) (rowcol l41 l43)
    (rowcol l41 l44) (rowcol l42 l22) (rowcol l42 l41)
    (rowcol l42 l43) (rowcol l42 l44) (rowcol l43 l23)
    (rowcol l43 l33) (rowcol l43 l41) (rowcol l43 l42)
    (rowcol l43 l44) (rowcol l43 l53) (rowcol l43 l63)
    (rowcol l44 l14) (rowcol l44 l24) (rowcol l44 l34)
    (rowcol l44 l41) (rowcol l44 l42) (rowcol l44 l43)
    (rowcol l44 l54) (rowcol l44 l64) (rowcol l53 l23)
    (rowcol l53 l33) (rowcol l53 l43) (rowcol l53 l54)
    (rowcol l53 l63) (rowcol l54 l14) (rowcol l54 l24)
    (rowcol l54 l34) (rowcol l54 l44) (rowcol l54 l53)
    (rowcol l54 l64) (rowcol l63 l23) (rowcol l63 l33)
    (rowcol l63 l43) (rowcol l63 l53) (rowcol l63 l64)
    (rowcol l64 l14) (rowcol l64 l24) (rowcol l64 l34)
    (rowcol l64 l44) (rowcol l64 l54) (rowcol l64 l63)
)

(:goal 
    ; (and (boxat b1 l21) (boxat b2 l24) (boxat b3 l34))
    ; (and (boxat b1 l21) (boxat b2 l34) (boxat b3 l24))
    ; (and (boxat b1 l24) (boxat b2 l21) (boxat b3 l34))
    (and (boxat b1 l24) (boxat b2 l34) (boxat b3 l21))
    ; (and (boxat b1 l34) (boxat b2 l21) (boxat b3 l24))
    ; (and (boxat b1 l34) (boxat b2 l24) (boxat b3 l21))
)

)

; plan
1. (push b3 l41 l42 l43)
   deleted: (roleat l41) (boxat b3 l42) (clear l43)
   added: (roleat l42) (boxat b3 l43) (clear l41)
   goals met: 1 of 3
2. (move l42 l41)
   deleted: (roleat l42) (clear l41)
   added: (clear l42) (roleat l41)
   goals met: 1 of 3
3. (move l41 l31)
   deleted: (roleat l41) (clear l31)
   added: (clear l41) (roleat l31)
   goals met: 1 of 3
4. (move l31 l21)
   deleted: (roleat l31) (clear l21)
   added: (clear l31) (roleat l21)
   goals met: 1 of 3
5. (move l21 l22)
   deleted: (roleat l21) (clear l22)
   added: (clear l21) (roleat l22)
   goals met: 1 of 3
6. (push b1 l22 l23 l24)
   deleted: (roleat l22) (boxat b1 l23) (clear l24)
   added: (roleat l23) (boxat b1 l24) (clear l22)
   goals met: 2 of 3
7. (move l23 l33)
   deleted: (roleat l23) (clear l33)
   added: (clear l23) (roleat l33)
   goals met: 2 of 3
8. (push b3 l33 l43 l53)
   deleted: (roleat l33) (boxat b3 l43) (clear l53)
   added: (roleat l43) (boxat b3 l53) (clear l33)
   goals met: 2 of 3
9. (move l43 l44)
   deleted: (roleat l43) (clear l44)
   added: (clear l43) (roleat l44)
   goals met: 2 of 3
10. (move l44 l54)
   deleted: (roleat l44) (clear l54)
   added: (clear l44) (roleat l54)
   goals met: 2 of 3
11. (move l54 l64)
   deleted: (roleat l54) (clear l64)
   added: (clear l54) (roleat l64)
   goals met: 2 of 3
12. (move l64 l63)
   deleted: (roleat l64) (clear l63)
   added: (clear l64) (roleat l63)
   goals met: 2 of 3
13. (push b3 l63 l53 l43)
   deleted: (roleat l63) (boxat b3 l53) (clear l43)
   added: (roleat l53) (boxat b3 l43) (clear l63)
   goals met: 2 of 3
14. (push b3 l53 l43 l33)
   deleted: (roleat l53) (boxat b3 l43) (clear l33)
   added: (roleat l43) (boxat b3 l33) (clear l53)
   goals met: 2 of 3
15. (move l43 l42)
   deleted: (roleat l43) (clear l42)
   added: (clear l43) (roleat l42)
   goals met: 2 of 3
16. (move l42 l41)
   deleted: (roleat l42) (clear l41)
   added: (clear l42) (roleat l41)
   goals met: 2 of 3
17. (move l41 l31)
   deleted: (roleat l41) (clear l31)
   added: (clear l41) (roleat l31)
   goals met: 2 of 3
18. (move l31 l21)
   deleted: (roleat l31) (clear l21)
   added: (clear l31) (roleat l21)
   goals met: 2 of 3
19. (move l21 l22)
   deleted: (roleat l21) (clear l22)
   added: (clear l21) (roleat l22)
   goals met: 2 of 3
20. (move l22 l23)
   deleted: (roleat l22) (clear l23)
   added: (clear l22) (roleat l23)
   goals met: 2 of 3
21. (push b1 l23 l24 l25)
   deleted: (roleat l23) (boxat b1 l24) (clear l25)
   added: (roleat l24) (boxat b1 l25) (clear l23)
   goals met: 1 of 3
22. (push b2 l24 l34 l44)
   deleted: (roleat l24) (boxat b2 l34) (clear l44)
   added: (roleat l34) (boxat b2 l44) (clear l24)
   goals met: 0 of 3
23. (push b2 l34 l44 l54)
   deleted: (roleat l34) (boxat b2 l44) (clear l54)
   added: (roleat l44) (boxat b2 l54) (clear l34)
   goals met: 0 of 3
24. (move l44 l43)
   deleted: (roleat l44) (clear l43)
   added: (clear l44) (roleat l43)
   goals met: 0 of 3
25. (push b3 l43 l33 l23)
   deleted: (roleat l43) (boxat b3 l33) (clear l23)
   added: (roleat l33) (boxat b3 l23) (clear l43)
   goals met: 0 of 3
26. (move l33 l34)
   deleted: (roleat l33) (clear l34)
   added: (clear l33) (roleat l34)
   goals met: 0 of 3
27. (move l34 l24)
   deleted: (roleat l34) (clear l24)
   added: (clear l34) (roleat l24)
   goals met: 0 of 3
28. (push b3 l24 l23 l22)
   deleted: (roleat l24) (boxat b3 l23) (clear l22)
   added: (roleat l23) (boxat b3 l22) (clear l24)
   goals met: 0 of 3
29. (push b3 l23 l22 l21)
   deleted: (roleat l23) (boxat b3 l22) (clear l21)
   added: (roleat l22) (boxat b3 l21) (clear l23)
   goals met: 1 of 3
30. (move l22 l23)
   deleted: (roleat l22) (clear l23)
   added: (clear l22) (roleat l23)
   goals met: 1 of 3
31. (move l23 l24)
   deleted: (roleat l23) (clear l24)
   added: (clear l23) (roleat l24)
   goals met: 1 of 3
32. (move l24 l34)
   deleted: (roleat l24) (clear l34)
   added: (clear l24) (roleat l34)
   goals met: 1 of 3
33. (move l34 l44)
   deleted: (roleat l34) (clear l44)
   added: (clear l34) (roleat l44)
   goals met: 1 of 3
34. (move l44 l43)
   deleted: (roleat l44) (clear l43)
   added: (clear l44) (roleat l43)
   goals met: 1 of 3
35. (move l43 l53)
   deleted: (roleat l43) (clear l53)
   added: (clear l43) (roleat l53)
   goals met: 1 of 3
36. (move l53 l63)
   deleted: (roleat l53) (clear l63)
   added: (clear l53) (roleat l63)
   goals met: 1 of 3
37. (move l63 l64)
   deleted: (roleat l63) (clear l64)
   added: (clear l63) (roleat l64)
   goals met: 1 of 3
38. (push b2 l64 l54 l44)
   deleted: (roleat l64) (boxat b2 l54) (clear l44)
   added: (roleat l54) (boxat b2 l44) (clear l64)
   goals met: 1 of 3
39. (push b2 l54 l44 l34)
   deleted: (roleat l54) (boxat b2 l44) (clear l34)
   added: (roleat l44) (boxat b2 l34) (clear l54)
   goals met: 2 of 3
40. (move l44 l43)
   deleted: (roleat l44) (clear l43)
   added: (clear l44) (roleat l43)
   goals met: 2 of 3
41. (move l43 l33)
   deleted: (roleat l43) (clear l33)
   added: (clear l43) (roleat l33)
   goals met: 2 of 3
42. (move l33 l23)
   deleted: (roleat l33) (clear l23)
   added: (clear l33) (roleat l23)
   goals met: 2 of 3
43. (move l23 l24)
   deleted: (roleat l23) (clear l24)
   added: (clear l23) (roleat l24)
   goals met: 2 of 3
44. (move l24 l14)
   deleted: (roleat l24) (clear l14)
   added: (clear l24) (roleat l14)
   goals met: 2 of 3
45. (move l14 l15)
   deleted: (roleat l14) (clear l15)
   added: (clear l14) (roleat l15)
   goals met: 2 of 3
46. (move l15 l16)
   deleted: (roleat l15) (clear l16)
   added: (clear l15) (roleat l16)
   goals met: 2 of 3
47. (move l16 l26)
   deleted: (roleat l16) (clear l26)
   added: (clear l16) (roleat l26)
   goals met: 2 of 3
48. (push b1 l26 l25 l24)
   deleted: (roleat l26) (boxat b1 l25) (clear l24)
   added: (roleat l25) (boxat b1 l24) (clear l26)
   goals met: 3 of 3
